#include "stdafx.h"
#include "Key.h"

char West[]  = "Запад";
char East[]  = "Восток";
char North[] = "Север";
char South[] = "Юг";
char Str_Err1[] = "Cтрока № %i не совпадает ни с 1 из сторон света\n";
char Str_Err2[] = "Cтрока № %i состоит из 1 слова\n";
char Str_Err3[] = "Cтрока № %i пустая\n";
char Str_Err4[] = "Произошла ошибка: %s при считывании строки %d\n";
char Str_Err5[] = "Недостаточно памяти\n";
char Str_Err6[] = "Ошибка открытия файла %s\n";
char Str_Err7[] = "Файл с координатами не получен\n";
char Str_Err8[] = "Для работы с данным продуктом пожалуйста укажите путь к текстовому файлу содержащему координаты\n";
char Str_Res[] = "Финальная координата = %d, %d\n";
